src/DataProcessors/ЗагрузкаНормКанбановУТП/ЗагрузкаНормКанбановУТП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаНормКанбановУТП</name>
  <attributes>
    <name>НаДату</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

src/InformationRegisters/НормыВремени/НормыВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НормыВремени</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>НормаВремени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаВремениНаПартию</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>МПЗ</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТехОперация</name>
    <type>
      <types>CatalogRef.ТехОперации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/DataProcessors/ЗагрузкаНормКанбановУТП/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Объект.НаДату = НачалоМесяца(ТекущаяДата());
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНормыВремени(Изделие,НВ,НВНаПартию)
	Попытка
	НачатьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция + 1;
	Номен = Справочники.Номенклатура.НайтиПоНаименованию(СокрЛП(Изделие),Истина);
		Если Не Номен.Пустая() Тогда
		НормаВремени = Число(НВ);	
		НормаВремениНаПартию = Число(НВНаПартию);
		НормыВремени = РегистрыСведений.НормыВремени.ПолучитьПоследнее(Объект.НаДату,Новый Структура("МПЗ,ТехОперация",Номен,ТехОперация));
			Если (НормыВремени.НормаВремени <> НормаВремени)или(НормыВремени.НормаВремениНаПартию <> НормаВремениНаПартию) Тогда
			НормыВремени = РегистрыСведений.НормыВремени.СоздатьМенеджерЗаписи();
			НормыВремени.Период = Объект.НаДату;
		    НормыВремени.МПЗ = Номен;
			НормыВремени.ТехОперация = ТехОперация;
			НормыВремени.НормаВремени = НормаВремени;
			НормыВремени.НормаВремениНаПартию = НормаВремениНаПартию;
			НормыВремени.Записать(Истина);
			КонецЕсли; 		
		Иначе	
		Сообщить(Изделие + " - не найдена в справочнике номенклатуры!");
		КонецЕсли;
	ЗафиксироватьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;Если ПараметрыСеанса.АктивнаТранзакция = 0 тогда СРМ_ОбменВебСервис.ОтправкаПослеТранзакции();КонецЕсли;
	Исключение
	Сообщить(ОписаниеОшибки());
	ОтменитьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;ПараметрыСеанса.ОбъектыСозданныеВТранзакции = Новый ХранилищеЗначения(Новый Массив);	
	КонецПопытки;
КонецПроцедуры 

&НаКлиенте
Процедура Загрузить(Команда)
Результат = ОбщийМодульКлиент.ОткрытьФайлExcel("Выберите файл c нормами времени УТП");
	Если Результат <> Неопределено Тогда
	ExcelЛист = Результат.ExcelЛист;
	КолСтрок = Результат.КоличествоСтрок;
	    Для к = 2 по КолСтрок Цикл
		Состояние("Обработка...",к*100/КолСтрок,"Загрузка норм времени УТП из файла...");
		ЗагрузитьНормыВремени(ExcelЛист.Cells(к,1).Value,ExcelЛист.Cells(к,2).Value,ExcelЛист.Cells(к,3).Value);	
	    КонецЦикла;
	Результат.Excel.Quit();
	КонецЕсли;  
КонецПроцедуры

&НаКлиенте
Процедура НаДатуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;
Ф = ПолучитьФорму("ОбщаяФорма.ВыборМесяца");
Результат = Ф.ОткрытьМодально();
	Если Результат <> Неопределено Тогда
	Объект.НаДату = НачалоМесяца(Результат);
	КонецЕсли;
КонецПроцедуры
